var fs = require('fs');



var allLocat = {
  '山东': [117.000923, 36.675807,'济南'],
  '河北': [115.48333, 38.03333,'石家庄'],
  '吉林': [125.35000, 43.88333,'长春'],
  '黑龙江省': [127.63333, 47.75000,'哈尔滨市'],
  '辽宁': [123.38333, 41.80000,'沈阳'],
  '内蒙古自治区': [111.670801, 41.818311,'呼和浩特'],
  '新疆维吾尔自治区': [87.68333, 43.76667,'乌鲁木齐'],
  '甘肃': [103.73333, 36.03333,'兰州'],
  '宁夏回族自治区': [106.26667, 37.46667,'银川'],
  '山西': [112.53333, 37.86667,'太原'],
  '陕西': [108.95000, 34.26667,'西安'],
  '河南': [113.65000, 34.76667,'郑州'],
  '安徽': [117.283042, 31.86119,'合肥'],
  '江苏': [119.78333, 32.05000,'南京'],
  '浙江': [120.20000, 30.26667,'杭州'],
  '福建': [118.30000, 26.08333,'福州'],
  '广东': [113.23333, 23.16667,'广州'],
  '江西': [115.90000, 28.68333,'南昌'],
  '海南': [110.35000, 20.01667,'海口'],
  '广西壮族自治区': [108.320004, 22.82402,'南宁'],
  '贵州': [106.71667, 26.56667,'贵阳'],
  '湖南': [113.00000, 28.21667,'长沙'],
  '湖北': [114.298572, 30.584355,'武汉'],
  '四川': [104.06667, 30.66667,'成都'],
  '云南': [102.73333, 25.05000,'昆明'],
  '西藏自治区': [91.00000, 30.60000,'拉萨'],
  '青海': [96.75000, 36.56667,'西宁'],
  '天津': [117.20000, 39.13333,'天津'],
  '上海': [121.55333, 31.20000,'上海'],
  '重庆': [106.45000, 29.56667,'重庆'],
  '北京': [116.41667, 39.91667,'北京'],
  // '台湾': [121.30, 25.03,''],
  // '香港特别行政区': [114.10000, 22.20000,''],
  // '澳门特别行政区': [113.50000, 22.20000,'']
}



var provinceList = Object.keys(allLocat);
fs.readFile('./sys_user_exp_copy.json',function(err,data){
  if(err){
    return err;
  }
  var json = JSON.parse(data.toString());
  var list = []
  // console.log(list.length);


  for(var i=0;i<100;i++){
    var s = provinceList[Math.round(Math.random()*(provinceList.length-1))];
    var a = {
      "id":"fa6a1b537b0141e6a82e2076038be3f36"+i,
      "lat":allLocat[s][1],
      "lng":allLocat[s][0],
      "jl":"17",
      "area":null,
      "cheer":"加油",
      "nation":"中国",
      "province":s,
      "city":allLocat[s][2],
      "address":allLocat[s][2],
      "cheer_date":"2020-7-20 17:42:12"
    }
    list.push(a);
  }


  json.RECORDS =list;


console.log(list);

  fs.writeFile('./sys_user_exp_copy.json',JSON.stringify(json),function(err){
    if(err){
      console.log(err);
    }
    console.log('success');
  })


})
