var fs = require('fs');



var allLocat = {
  '山东省': [117.000923, 36.675807],
  '河北省': [115.48333, 38.03333],
  '吉林省': [125.35000, 43.88333],
  '黑龙江省': [127.63333, 47.75000],
  '辽宁省': [123.38333, 41.80000],
  '内蒙古自治区': [111.670801, 41.818311],
  '新疆维吾尔自治区': [87.68333, 43.76667],
  '甘肃省': [103.73333, 36.03333],
  '宁夏回族自治区': [106.26667, 37.46667],
  '山西省': [112.53333, 37.86667],
  '陕西省': [108.95000, 34.26667],
  '河南省': [113.65000, 34.76667],
  '安徽省': [117.283042, 31.86119],
  '江苏省': [119.78333, 32.05000],
  '浙江省': [120.20000, 30.26667],
  '福建省': [118.30000, 26.08333],
  '广东省': [113.23333, 23.16667],
  '江西省': [115.90000, 28.68333],
  '海南省': [110.35000, 20.01667],
  '广西壮族自治区': [108.320004, 22.82402],
  '贵州省': [106.71667, 26.56667],
  '湖南省': [113.00000, 28.21667],
  '湖北省': [114.298572, 30.584355],
  '四川省': [104.06667, 30.66667],
  '云南省': [102.73333, 25.05000],
  '西藏自治区': [91.00000, 30.60000],
  '青海省': [96.75000, 36.56667],
  '天津市': [117.20000, 39.13333],
  '上海市': [121.55333, 31.20000],
  '重庆市': [106.45000, 29.56667],
  '北京市': [116.41667, 39.91667],
  '台湾省': [121.30, 25.03],
  '香港特别行政区': [114.10000, 22.20000],
  '澳门特别行政区': [113.50000, 22.20000]
}

fs.readFile('./sys_user_exp_copy.json',function(err,data){
  if(err){
    return err;
  }
  var json = JSON.parse(data.toString());
  var list = []
  console.log(list.length);


/*  for(var i=0;i<1000;i++){

  }*/

  var a = {
    "id":"fa6a1b537b0141e6a82e2076038be3f36",
    "lat":"26.017297563851745",
    "lng":"119.3994140625",
    "jl":"17",
    "area":null,
    "cheer":"加油",
    "nation":"中国",
    "province":"福建省",
    "city":"福州市",
    "address":"福州市",
    "cheer_date":"2020-7-20 17:42:12"
  }
  list.push(a);
  json.RECORDS =list;




  fs.writeFile('./sys_user_exp_copy.json',JSON.stringify(json),function(err){
    if(err){
      console.log(err);
    }
    console.log('success');
  })

})
